# From index to column in a Pandas Dataframe

### Imports

In [1]:
% matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

### Creating a Dataframe

In [2]:
data = {"games" : list("ABCAA"),
        "team" : ["Air","Earth", "Air","Earth","Earth"],
       "players" : ["John", "Thomas","Chritie","Alex", "Jack"],
       "scores" : [23,34,12,73,23]}

df = pd.DataFrame(data, index = np.arange(5))
df

  games  players  scores   team
0     A     John      23    Air
1     B   Thomas      34  Earth
2     C  Chritie      12    Air
3     A     Alex      73  Earth
4     A     Jack      23  Earth

In [3]:
df1 = df.set_index("games")
df1

       players  scores   team
games
A         John      23    Air
B       Thomas      34  Earth
C      Chritie      12    Air
A         Alex      73  Earth
A         Jack      23  Earth

### From one index to column

In [4]:
df1.reset_index(level = 0, inplace=True)
df1

  games  players  scores   team
0     A     John      23    Air
1     B   Thomas      34  Earth
2     C  Chritie      12    Air
3     A     Alex      73  Earth
4     A     Jack      23  Earth

### From multiple index to columns

In [5]:
df2 = df.set_index(["team","games"])
df2

             players  scores
team  games
Air   A         John      23
Earth B       Thomas      34
Air   C      Chritie      12
Earth A         Alex      73
      A         Jack      23

In [6]:
df2.reset_index(level=["team","games"], inplace=True)
df2

    team games  players  scores
0    Air     A     John      23
1  Earth     B   Thomas      34
2    Air     C  Chritie      12
3  Earth     A     Alex      73
4  Earth     A     Jack      23